# CodeTutor - ИИ-Помощник для подготовки к ЕГЭ по информатике

**CodeTutor** - это Telegram-бот на базе aiogram 3 и нейросети Gemini, созданный для автоматизации проверки кода на Python учащихся при подготовке к ЕГЭ по информатике.

---

## Какую проблему решает проект и для кого?

* **Для учеников:** При самостоятельной подготовке к ЕГЭ часто некому подсказать, почему программа работает неправильно. Бот заменяет репетитора: он мгновенно находит логические и синтаксические ошибки в коде, объясняет их понятным языком и направляет к правильному решению.
* **Для учителей:** Снижает нагрузку на проверку однотипных домашних заданий, позволяя сфокусироваться на разборе сложных.

---

## Как запустить проект

**1.** Клонируйте репозиторий:
   ```bash
   git clone https://github.com/vmkod/codetutor_ege.git
   cd codetutor_ege
   ```

**2.** Установите зависимости:
```bash
pip install -r requirements.txt 
```

**3.** Получите ключ Gemini из [Google AI Studio](ai.dev)

**4.** Получите токен Телеграмм бота в [@BotFather](https://t.me/BotFather)

**5.** Создайте файл конфигурации .env в корневой директории:
```bash
TELEGRAM_BOT_TOKEN=токен_телеграмм_бота
GEMINI_API_KEY=api_ключ_gemini
ADMIN_ID=telegram_id_администратора
```

**6.** Запустите бота:
```bash 
python main.py
```
**7.** База данных создается и заполняется автоматически при первом запуске: 4 вида заданий по 1 примеру.

---

## Входные данные и результат

* **Входные данные:** Ученик выбирает номер задачи из меню, получает случайное условие из базы данных и отправляет текстовое сообщение со своей программой на Python.
* **Результат:** Бот отправляет запрос к ИИ и выводит сообщение с подробным разбором: работает ли алгоритм правильно, где допущена ошибка и как ее исправить.

---

## Пример работы:
    1. Ученик нажимает /start.

    2. Ученик выбирает "Задание №5".

    3. Бот присылает условие задачи: 
    Задание №5

    На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом:
    1) Строится двоичная запись числа N.
    2) К этой записи дописываются справа ещё два разряда: если число N чётное, в конец дописывается 01, иначе 10.
    Полученная таким образом запись является двоичной записью искомого числа R.
    Укажите минимальное число R, большее 43, которое может быть получено в результате работы этого алгоритма.
    Отправь мне свой вариант кода на Python для этой задачи.

    4. Ученик отправляет сообщение "Не знаю".

    5. Бот присылает ответ: 
    Это не похоже на код на Python!
    В твоем сообщении должны быть базовые конструкции языка (например: def, print, for).
    Отправь рабочее решение для Задания №5:

    6. Ученик отправляет код: 
    res = []
    for n in range(1, 1000):
        n2 = bin(n)[2:]
        if n % 2 == 0:
            n2 += "01"
        else:
            n2 += "10"
        r = int(n2, 2)
        if r < 43:
            res.append(r)
    print(min(res))

    7. Бот присылает разбор:
    Разбор Задания №5
    Логика: Содержит ошибки.
    Условие задачи требует найти минимальное R, которое больше 43. В коде допущена логическая ошибка в условии фильтрации (r < 43), а также неверно определена цель поиска (нужно искать минимум среди тех, что больше 43).
    Анализ ошибок:
    - Строка if r < 43:: должна быть if r > 43:.
    - Строка print(min(res)): логически верна при исправленном условии, но лучше сразу искать первое подходящее число, так как цикл идет по возрастанию n.
    Эталонное решение:
    for n in range(1, 1000):
        b = bin(n)[2:]
        r = int(b + ('01' if n % 2 == 0 else '10'), 2)
        if r > 43:
            print(r)
            break
---

## Функционал админ-панели и система статистики

В боте реализована скрытая система разграничения прав доступа:
* **Для учеников:** Доступна кнопка "Моя статистика", отображающая личный прогресс (сколько раз и какие задачи были отправлены на проверку)
* **Для администратора:** Доступна скрытая кнопка "Админ-панель" (видимая только для ID из .env), позволяющая:
    1. Просматривать глобальную статистику бота (общее число пользователей, количество задач в базе и их распределение).
    2. Добавлять новые задания в базу данных.

---

## Инструменты и библиотеки

Проект написан на Python 3.12 с использованием следующих библиотек:

* aiogram 3.x — асинхронный фреймворк для работы с Telegram Bot API.
* google-genai — официальный SDK для интеграции с языковой моделью Gemini.
* sqlite3 — встроенная база данных для хранения задач, логов пользователей и статистики.
* pydantic-settings — для безопасного управления конфигурацией и токенами через файл .env.

---

## Роль искусственного интеллекта

В проекте используется модель Gemini 3.1 Flash Lite. Роль ИИ заключается в:
* Глубоком анализе кода ученика в контексте конкретного условия задачи ЕГЭ.
* Формирование подсказок в стиле помощника.
* Скоростной генерации ответов.

---

## Ограничения проекта

* Код принимается только в виде текста в сообщении (файлы .py и .txt не обрабатываются).  
* Максимальная длина сообщения ограничена лимитами Telegram и контекстом модели Gemini.
* Лимиты бесплатного API.
* Контекст одной задачи (бот не хранит историю ошибок).

---

## Идеи для дальнейшего развития
* Добавление других типов задач.
* Система мотивации (добавление системы уровней, ежедневных целей, рейтинга и т.д.).
* Интеллектуальный подбор задач (реализация алгоритма, который анализирует статистику ученика и, если видит частые ошибки в определенном задании, начинает предлагать более простые).